_Rarzrabotki/Rarus/USO2/Reports/СМ_ВедомостьПотребностиВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СМ_ВедомостьПотребностиВРесурсах</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НумерацияПозицийЛокальныхСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_НумерацияПозицийЛокальныхСмет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВПределахРаздела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/СМ_ВедомостьПотребностиВРесурсах/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Функция формирует табличный документ отчета (используется для печати из форм списков и элементов).
//
// Параметры:
//     Смета - ссылка на один из документов "ЛокальнаяСмета", "ОбъектнаяСмета", "СводнаяСмета" или
//		на справочник "Объекты строительства".
//
// Возвращаемое значение:
//     ТабличныйДокумент - результат формирования отчета с заданными параметрами.
//
Процедура ПолучитьЗаполненныйОтчет(МассивСмет, ОбъектСтроительстава, ДокументРезультат, ТолькоФактическиеРесурсы, Ранжировать, ПечатьБланка, НаОстаток,ГруппироватьСтатусы = Ложь, СтатусРесурса = Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;

	ВыводитьНомерЛС = Истина;
	Если НЕ ЗначениеЗаполнено(ОбъектСтроительстава) Тогда
		Для Каждого ТекЭлемент Из МассивСмет Цикл
			Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
				ВыводитьНомерЛС = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ТипЗнч(МассивСмет) = Тип("Массив") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция
		|ИЗ
		|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		|ГДЕ
		|	СМ_ПозицияЛокальнойСметы.ИДСметы В(&МассивСмет) И
		|	СМ_ПозицияЛокальнойСметы.Расчет = ИСТИНА И
		|	СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СМ_ПозицияЛокальнойСметы.Ссылка
		|ИЗ
		|	Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		|		ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_ПозицияЛокальнойСметы.ИДСметы
		|ГДЕ
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка.ПометкаУдаления = ЛОЖЬ И					   	
		|	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА И
		|	СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ПозицияЛокальнойСметы.Расчет = ИСТИНА И
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка В(&МассивСмет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СМ_ПозицияЛокальнойСметы.Ссылка
		|ИЗ
		|	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		|			ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_ПозицияЛокальнойСметы.ИДСметы
		|		ПО СМ_СводнаяСметаСметы.Смета = СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка
		|ГДЕ
		|	СМ_СводнаяСметаСметы.Ссылка В (&МассивСмет) И
		|	СМ_СводнаяСметаСметы.Ссылка.ПометкаУдаления = ЛОЖЬ И
		|	СМ_СводнаяСметаСметы.Расчет = ИСТИНА И
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА И
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ПозицияЛокальнойСметы.Расчет = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СМ_ПозицияЛокальнойСметы.Ссылка
		|ИЗ
		|	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		|		ПО СМ_СводнаяСметаСметы.Смета = СМ_ПозицияЛокальнойСметы.ИДСметы
		|ГДЕ
		|	СМ_СводнаяСметаСметы.Ссылка В (&МассивСмет) И
		|	СМ_СводнаяСметаСметы.Ссылка.ПометкаУдаления = ЛОЖЬ И
		|	СМ_СводнаяСметаСметы.Расчет = ИСТИНА И
		|	СМ_СводнаяСметаСметы.Смета.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ И
		|	СМ_ПозицияЛокальнойСметы.Расчет = ИСТИНА";
	
		Запрос.УстановитьПараметр("МассивСмет",МассивСмет);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Неправильный формат передаваемого параметра'"));
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапроса.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='По данным отчета нет подобранных данных'"));
		Возврат;
	КонецЕсли;
	
	// Определение валюты выводимой в заголовке печатной формы.
	// Формирование по объекту строительства или группе объектов.
	Если ЗначениеЗаполнено(ОбъектСтроительстава) Тогда
		ПечВалюта = "";
	// Формирование по смете	
	Иначе
		СтруктураВалюты = СМ_СметаПечатьСервер.ПолучитьСтруктуруОбозначенияВалюты(МассивСмет[0]);
		ПечВалюта 		= ", " + СтруктураВалюты.ПечВалюта;
	КонецЕсли;
	
	СписокПозиций = Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("Позиция"));

	// Получение номеров позиций из регистра СМ_НумерацияПозицийЛокальныхСмет.
	ЗапросНомера = Новый Запрос;
	ЗапросНомера.Текст = "
	|ВЫБРАТЬ
	|	СМ_НумерацияПозицийЛокальныхСмет.Позиция,
	|	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	|	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	|	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер
	|ИЗ
	|	РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	|ГДЕ
	|	СМ_НумерацияПозицийЛокальныхСмет.Позиция В (&МассивПозиций)	
	|УПОРЯДОЧИТЬ ПО
	|	СМ_НумерацияПозицийЛокальныхСмет.Позиция.Номер";
	
	ЗапросНомера.УстановитьПараметр("МассивПозиций",РезультатЗапроса.ВыгрузитьКолонку("Позиция"));	
	ТабНомеров = ЗапросНомера.Выполнить().Выгрузить();
	
	//	Получить данные
	//ТаблицаРесурсов			= СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовСметы(СписокПозиций,Истина,Истина,Истина,ТолькоФактическиеРесурсы,Истина,,ГруппироватьСтатусы);
	ТаблицаРесурсов			= СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовСметы(СписокПозиций,Истина,Истина,Истина,ТолькоФактическиеРесурсы,Истина,,Истина);
	ТаблицаРесурсовПоАктам	= ПолучитьТаблицуРесурсовПоАктамНаСервере(МассивСмет,ГруппироватьСтатусы);
	
	Если СтатусРесурса <> Неопределено Тогда
		МассивУдаляемыхСтрок = Новый Массив;
		Для каждого СтрокаТаб Из ТаблицаРесурсов Цикл
			Если СтрокаТаб.СтатусРесурса <> СтатусРесурса Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаТаб);
			КонецЕсли; 
		КонецЦикла; 
		Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
			ТаблицаРесурсов.Удалить(УдаляемаяСтрока);
		КонецЦикла; 
		
		МассивУдаляемыхСтрок.Очистить();
		Для каждого СтрокаТаб Из ТаблицаРесурсовПоАктам Цикл
			Если СтрокаТаб.СтатусРесурса <> СтатусРесурса Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаТаб);
			КонецЕсли; 
		КонецЦикла; 
		Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
			ТаблицаРесурсовПоАктам.Удалить(УдаляемаяСтрока);
		КонецЦикла; 			
	КонецЕсли; 
	
	// Заполнение номера позиции в смете и номера локальной сметы
	ТаблицаРесурсов.Колонки.Добавить("НомерПозиции");
	ТаблицаРесурсов.Колонки.Добавить("НомерЛС");
	Для Каждого ТекСтрока Из ТаблицаРесурсов Цикл
		
		НайденнаяСтрока = ТабНомеров.Найти(ТекСтрока.Позиция,"Позиция");
		Если НайденнаяСтрока <> Неопределено Тогда
			ТекСтрока.НомерПозиции = НайденнаяСтрока.ПорНомер;		
		КонецЕсли;
		
		ТекСтрока.НомерЛС = "";
		Если ВыводитьНомерЛС Тогда
			Если ЗначениеЗаполнено(ТекСтрока.Позиция.ИДСметы) Тогда
				ТекСтрока.НомерЛС = ТекСтрока.Позиция.ИДСметы.НомерСметы; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВнешниеНаборыДанных		= Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРесурсов"			, ТаблицаРесурсов);
	ВнешниеНаборыДанных.Вставить("ТаблицаРесурсовПоАктам"	, ТаблицаРесурсовПоАктам);
	
	Если ГруппироватьСтатусы Тогда
		СхемаКомпоновкиДанных	= ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхСтатусы");
	Иначе
		СхемаКомпоновкиДанных	= ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли;
	
	// ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки;// СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Если ЗначениеЗаполнено(ОбъектСтроительстава) Тогда
		
		Если ТипЗнч(ОбъектСтроительстава) = Тип("СписокЗначений") Тогда
			Код = "";
			Для Каждого Стройка Из ОбъектСтроительстава Цикл
				Код = Код+?(Код = "",Стройка.Значение.Код,"; "+Стройка.Значение.Код);
			КонецЦикла;
			
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерВедомости"			, Код);
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеВедомости"	, Строка(ОбъектСтроительстава));
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказчик"				, СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ОбъектСтроительстава[0].Значение, "ОсновнойЗаказчик"));
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подрядчик"				, СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ОбъектСтроительстава[0].Значение, "ОсновнойПодрядчик"));
		Иначе
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерВедомости"			, ОбъектСтроительстава.Код);
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеВедомости"	, ОбъектСтроительстава.Наименование);
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказчик"				, СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ОбъектСтроительстава, "ОсновнойЗаказчик"));
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подрядчик"				, СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ОбъектСтроительстава, "ОсновнойПодрядчик"));
		КонецЕсли;
		
	Иначе
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерВедомости"			, МассивСмет[0].НомерСметы);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеВедомости"	, МассивСмет[0].Наименование);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказчик"				, МассивСмет[0].Заказчик);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подрядчик"				, МассивСмет[0].Подрядчик);
		
	КонецЕсли;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПечВалюта", ПечВалюта);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПечатьБланка", ПечатьБланка);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаОстаток"	, НаОстаток);
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", ?(ПечатьБланка, РасположениеИтоговКомпоновкиДанных.Нет, РасположениеИтоговКомпоновкиДанных.Конец));	
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных и
	// созданные ранее настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Скомпонуем результат.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();

	// Выводим результат в табличный документ.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.НачатьВывод();
	
	Параметры = Новый Структура;
	
	ПередВыводомМакета(ДокументРезультат, МакетКомпоновки, Параметры);

	//
	Пока Истина Цикл
		
		ЭлементВывода = ПроцессорКомпоновки.Следующий();
		Если ЭлементВывода = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Отказ = Ложь;
		
		ПередВыводомЭлементаМакета(ДокументРезультат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементВывода);
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();	
	
	ОбластьШапкиПовтор	= ДокументРезультат.Область(Параметры.ОбластьШапкиОтчета.Низ, ,Параметры.ОбластьШапкиОтчета.Низ);
	
	ДокументРезультат.НижнийКолонтитул.Выводить		= Истина;
	ДокументРезультат.НижнийКолонтитул.Шрифт		= Новый Шрифт(ДокументРезультат.НижнийКолонтитул.Шрифт, , , , Истина);
	ДокументРезультат.НижнийКолонтитул.ТекстВЦентре = НСтр("ru='Стр. [&НомерСтраницы] из [&СтраницВсего]'");
	ДокументРезультат.ФиксацияСверху				= 9;
	ДокументРезультат.ПовторятьПриПечатиСтроки		= ОбластьШапкиПовтор;
	ДокументРезультат.АвтоМасштаб					= Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуРесурсовПоАктамНаСервере(МассивСмет,ГруппироватьСтатусы)
	
	//
	ТаблицаЗначений			= Новый ТаблицаЗначений;
	АктыВыполненныхРабот	= ПолучитьАктыВыполненныхРаботНаСервере(МассивСмет);
	
	//
	Для Каждого АктВыполненныхРабот Из АктыВыполненныхРабот Цикл
		
		Если АктВыполненныхРабот = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаСтоимостиРесурсовАкта = СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовАкта(АктВыполненныхРабот,Истина,,Истина,Истина,Истина,,ГруппироватьСтатусы);
		
		Если НЕ ТаблицаЗначений.Количество() Тогда
			ТаблицаЗначений	= ТаблицаСтоимостиРесурсовАкта.Скопировать();
		Иначе
			Для Каждого Строка Из ТаблицаСтоимостиРесурсовАкта Цикл
				ТаблицаЗначенийСтрока	= ТаблицаЗначений.Добавить();	
				ЗаполнитьЗначенияСвойств(ТаблицаЗначенийСтрока, Строка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаЗначений.Колонки.Найти("Ресурс") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("Ресурс");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("НаименованиеРесурса") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("НаименованиеРесурса");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("ЕдиницаИзмеренияРесурса") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("ЕдиницаИзмеренияРесурса");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("КодРесурса") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("КодРесурса");
	КонецЕсли;
	
	//Если ТаблицаЗначений.Колонки.Найти("СтатусРесурса") = Неопределено И ГруппироватьСтатусы Тогда
	Если ТаблицаЗначений.Колонки.Найти("СтатусРесурса") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("СтатусРесурса");
	КонецЕсли;

	Если ТаблицаЗначений.Колонки.Найти("Позиция") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("Позиция");
	КонецЕсли;
	
	ТаблицаЗначений.Колонки.Добавить("РасходПоНормеАкт");
	ТаблицаЗначений.Колонки.Добавить("РасходПоФактуАкт");
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Строка["РасходПоНормеАкт"]	= Строка.РасходПоНорме;
		Строка["РасходПоФактуАкт"]	= Строка.РасходПоФакту;	
	КонецЦикла;
	
	//
	//ТаблицаЗначений.Свернуть("Позиция, КодРесурса, Ресурс, НаименованиеРесурса, ЕдиницаИзмеренияРесурса"+?(ГруппироватьСтатусы, ", СтатусРесурса", ""), "РасходПоНормеАкт, РасходПоФактуАкт");
	ТаблицаЗначений.Свернуть("Позиция, КодРесурса, Ресурс, НаименованиеРесурса, ЕдиницаИзмеренияРесурса, СтатусРесурса", "РасходПоНормеАкт, РасходПоФактуАкт");
	
	//
	Возврат ТаблицаЗначений;
	
КонецФункции //Функция ПолучитьТаблицуРесурсовПоАктамНаСервере()

Функция ПолучитьАктыВыполненныхРаботНаСервере(МассивСмет)
	
	//
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВЗ_ЛокальныеСметы.Смета КАК ЛокальнаяСмета,
	      	               |	СМ_АктВыполненныхРабот.Ссылка КАК АктВыполненныхРабот
	      	               |ИЗ
	      	               |	(ВЫБРАТЬ
	      	               |		ВЗ_СводнаяСметаЛокальныеСметы.Смета КАК Смета
	      	               |	ИЗ
	      	               |		(ВЫБРАТЬ
	      	               |			СМ_СводнаяСметаСметы.Смета КАК Смета
	      	               |		ИЗ
	      	               |			Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
	      	               |		ГДЕ
	      	               |			СМ_СводнаяСметаСметы.Ссылка В(&Сметы)
	      	               |			И ТИПЗНАЧЕНИЯ(СМ_СводнаяСметаСметы.Смета) = ТИП(Документ.СМ_ЛокальнаяСмета)
	      	               |		
	      	               |		ОБЪЕДИНИТЬ ВСЕ
	      	               |		
	      	               |		ВЫБРАТЬ
	      	               |			СМ_ЛокальнаяСмета.Ссылка
	      	               |		ИЗ
	      	               |			Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
	      	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	      	               |				ПО СМ_СводнаяСметаСметы.Смета = СМ_ЛокальнаяСмета.Ссылка
	      	               |		ГДЕ
	      	               |			СМ_СводнаяСметаСметы.Ссылка В(&Сметы)
	      	               |			И ТИПЗНАЧЕНИЯ(СМ_СводнаяСметаСметы.Смета) = ТИП(Документ.СМ_ОбъектнаяСмета)) КАК ВЗ_СводнаяСметаЛокальныеСметы
	      	               |	
	      	               |	ОБЪЕДИНИТЬ ВСЕ
	      	               |	
	      	               |	ВЫБРАТЬ
	      	               |		СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета
	      	               |	ИЗ
	      	               |		Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
	      	               |	ГДЕ
	      	               |		СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка В(&Сметы)
	      	               |	
	      	               |	ОБЪЕДИНИТЬ ВСЕ
	      	               |	
	      	               |	ВЫБРАТЬ
	      	               |		СМ_ЛокальнаяСмета.Ссылка
	      	               |	ИЗ
	      	               |		Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	      	               |	ГДЕ
	      	               |		СМ_ЛокальнаяСмета.Ссылка В(&Сметы)) КАК ВЗ_ЛокальныеСметы
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	      	               |		ПО ВЗ_ЛокальныеСметы.Смета = СМ_АктВыполненныхРабот.ЛокальнаяСмета
	      	               |ГДЕ
	      	               |	НЕ СМ_АктВыполненныхРабот.Ссылка ЕСТЬ NULL 
	      	               |	И СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ВЗ_ЛокальныеСметы.Смета,
	      	               |	СМ_АктВыполненныхРабот.Ссылка");
	Запрос.УстановитьПараметр("Сметы", МассивСмет);
	
	//
	Результат				= Запрос.Выполнить().Выгрузить();
	АктыВыполненныхРабот	= Результат.ВыгрузитьКолонку("АктВыполненныхРабот");
	
	//
	Возврат АктыВыполненныхРабот;
	
КонецФункции

// Получает все группы указанной группы.
//
// Параметры:
//     ИсходныйЭлемент - СправочникСсылка.СМ_ОбъектыСтроительства - группа для которой ищем входящие.
//     МассивРодителей - СписокЗначений - список всех групп.
//
Процедура ПолучитьВсехРодителей(ИсходныйЭлемент,МассивРодителей) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ОбъектыСтроительства.Ссылка
	               |ИЗ
	               |	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
	               |ГДЕ
	               |	СМ_ОбъектыСтроительства.Родитель = &Ссылка
	               |	И СМ_ОбъектыСтроительства.ЭтоГруппа = ИСТИНА";
	Запрос.УстановитьПараметр("Ссылка",ИсходныйЭлемент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивРодителей.Добавить(ИсходныйЭлемент);
	Пока Выборка.Следующий() Цикл
		ТекРодитель = Выборка.Ссылка;
		ПолучитьВсехРодителей(ТекРодитель,МассивРодителей)
	КонецЦикла;
КонецПроцедуры

Процедура ПередВыводомМакета(Результат, МакетКомпоновки, Параметры)
	
	НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, Параметры);
	
КонецПроцедуры

Процедура ПередВыводомЭлементаМакета(Результат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ)
	
	НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, Параметры);
	
КонецПроцедуры

// Вызывается в обработчике "ПередВыводомМакета"
//
Процедура НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, ПараметрыОтчета)

	ПараметрыОтчета.Вставить("МакетШапки", ПолучитьМакетШапки(МакетКомпоновки.Тело));
	
КонецПроцедуры

// Возвращает имя макета шапки отчета
//
Функция ПолучитьМакетШапки(ТелоМакетаКомпоновки)

	КоличествоЭлементовТела = ТелоМакетаКомпоновки.Количество();
	Для ИндексЭлемента = 0 По КоличествоЭлементовТела - 1 Цикл
		
		ЭлементТела = ТелоМакетаКомпоновки[ИндексЭлемента];
		Если ТипЗнч(ЭлементТела) = Тип("ТаблицаМакетаКомпоновкиДанных")
			И Не ПустаяСтрока(ЭлементТела.МакетШапки) Тогда
			
			Возврат ЭлементТела.МакетШапки;
			
		ИначеЕсли ТипЗнч(ЭлементТела) = Тип("ГруппировкаМакетаКомпоновкиДанных") И ИндексЭлемента > 0
			И ТипЗнч(ТелоМакетаКомпоновки[ИндексЭлемента - 1]) = Тип("МакетОбластиМакетаКомпоновкиДанных") 
			И Не ПустаяСтрока(ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет) Тогда
			
			Возврат ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается в обработчике "ПередВыводомЭлементаМакета"
//
Процедура НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, ПараметрыОтчета)
	
	Если Не ПараметрыОтчета.Свойство("ОбластьШапкиОтчета") Тогда
		Если ПустаяСтрока(ПараметрыОтчета.МакетШапки) Тогда
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета");
		ИначеЕсли Не ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") И ЭлементВывода.Макет = ПараметрыОтчета.МакетШапки Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиНачало", Результат.ВысотаТаблицы + 1);
		ИначеЕсли ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиКонец", Результат.ВысотаТаблицы);
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета", Результат.Область(ПараметрыОтчета.НомерСтрокиШапкиНачало, , ПараметрыОтчета.НомерСтрокиШапкиКонец));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
